mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                    <register>
                        <name>TIMA1_CPU_INT_RIS</name>
                        <description>Raw interrupt status</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>Z</name>
                                <description>Zero event generated an interrupt.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>L</name>
                                <description>Load event generated an interrupt.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD0</name>
                                <description>Capture or compare down event generated an interrupt CCP0</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD1</name>
                                <description>Capture or compare down event generated an interrupt CCP1</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU0</name>
                                <description>Capture or compare up event generated an interrupt CCP0</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU1</name>
                                <description>Capture or compare up event generated an interrupt CCP1</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TOV</name>
                                <description>Trigger overflow</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>F</name>
                                <description>Fault</description>
                                <bitOffset>0x18</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD4</name>
                                <description>Compare down event generated an interrupt CCD4</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCD5</name>
                                <description>Compare down event generated an interrupt CCD5</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU4</name>
                                <description>Compare up event generated an interrupt CCU4</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCU5</name>
                                <description>Compare up event generated an interrupt CCP5</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Event Cleared</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Event Set</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
