mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMA1_CCACT_01[%s]</name>
                        <description>Capture or Compare Action Registers 0/1</description>
                        <addressOffset>0x70</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ZACT</name>
                                <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>LACT</name>
                                <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CDACT</name>
                                <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CUACT</name>
                                <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2DACT</name>
                                <description>CCP Output Action on CC2D event.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CC2UACT</name>
                                <description>CCP Output Action on CC2U event.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FENACT</name>
                                <description>CCP Output Action on Fault Entry
This field describes the resulting action of the signal generator upon detecting a fault.</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGHZ</name>
                                            <description>CCP output value is tristated</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FEXACT</name>
                                <description>CCP Output Action on Fault Exit
This field describes the resulting action of the signal generator upon exiting the fault condition.</description>
                                <bitOffset>0x19</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_TOGGLE</name>
                                            <description>CCP output value is toggled</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGHZ</name>
                                            <description>CCP output value is tristated</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>SWFRCACT</name>
                                <description>CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>SWFRCACT_CMPL</name>
                                <description>CCP Complimentary output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                                <bitOffset>0x1E</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_HIGH</name>
                                            <description>CCP Complimentary output value is set high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_LOW</name>
                                            <description>CCP Complimentary output value is set low</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
