mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WUC</name>
            <groupName>WUC</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40424000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x500</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>WUC_FSUB_0</name>
                    <description>Subscriber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>WUC_FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>TIMB0</name>
            <groupName>TIMB</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x400B8000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TIMB0_FSUB_0</name>
                    <description>Subscriber Configuration Register.</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>TIMB0_FPUB_0</name>
                    <description>Publisher Port 0</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>24</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>TIMB0_GPRCM[%s]</name>
                    <description></description>
                    <addressOffset>0x800</addressOffset>
                    <register>
                        <name>TIMB0_PWREN</name>
                        <description>Power enable</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>ENABLE</name>
                                <description>Enable the power</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable Power</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable Power</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMB0_RSTCTL</name>
                        <description>Reset Control</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RESETSTKYCLR</name>
                                <description>Clear the RESETSTKY bit in the STAT register</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear reset sticky bit</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RESETASSERT</name>
                                <description>Assert reset to the peripheral</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ASSERT</name>
                                            <description>Assert reset</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMB0_STAT</name>
                        <description>Status Register</description>
                        <addressOffset>0x14</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>RESETSTKY</name>
                                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NORES</name>
                                            <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RESET</name>
                                            <description>The peripheral was reset since the last bit clear</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>TIMB0_PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STOP</name>
                                        <description>The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RUN</name>
                                        <description>The peripheral ignores the state of the Core Halted input</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SOFT</name>
                            <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>IMMEDIATE</name>
                                        <description>The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DELAYED</name>
                                        <description>The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
