mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>TIMB0_CPU_INT[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>TIMB0_CPU_INT_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xA</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No bit is set means there is no pending interrupt request</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT0OVF</name>
                                            <description>Counter0 period match  interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT0STRT</name>
                                            <description>Counter 0 start</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT0STOP</name>
                                            <description>Counter0 stop</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT1OVF</name>
                                            <description>Counter1 period match  interrupt</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT1STRT</name>
                                            <description>Counter 1 start</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT1STOP</name>
                                            <description>Counter1 stop</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT2OVF</name>
                                            <description>Counter2 period match  interrupt</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT2STRT</name>
                                            <description>Counter 2 start</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT2STOP</name>
                                            <description>Counter2 stop</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT3OVF</name>
                                            <description>Counter3 period match  interrupt</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT3STRT</name>
                                            <description>Counter 3 start</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT3STOP</name>
                                            <description>Counter3 stop</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT4OVF</name>
                                            <description>Counter4 period match  interrupt</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT4STRT</name>
                                            <description>Counter 4 start</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT4STOP</name>
                                            <description>Counter4 stop</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT5OVF</name>
                                            <description>Counter5 period match  interrupt</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT5STRT</name>
                                            <description>Counter 5 start</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT5STOP</name>
                                            <description>Counter5 stop</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT6OVF</name>
                                            <description>Counter6 period match  interrupt</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT6STRT</name>
                                            <description>Counter 6 start</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT6STOP</name>
                                            <description>Counter6 stop</description>
                                            <value>0x15</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT7OVF</name>
                                            <description>Counter7 period match  interrupt</description>
                                            <value>0x16</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT7STRT</name>
                                            <description>Counter 7 start</description>
                                            <value>0x17</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNT7STOP</name>
                                            <description>Counter7 stop</description>
                                            <value>0x18</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
