mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT7OVF</name>
                                <description>Clear Counter 7 period match flag.</description>
                                <bitOffset>0x15</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT7STRT</name>
                                <description>Clear Counter 7 start event flag.</description>
                                <bitOffset>0x16</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT7STOP</name>
                                <description>Clear Counter 7 stop event flag.</description>
                                <bitOffset>0x17</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>TIMB1_EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>CPU_INT_CFG</name>
                            <description>Event line mode select for event corresponding to CPU_INT</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>GEN_EVENT_CFG</name>
                            <description>Event line mode select for event corresponding to CPU_INT</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SOFTWARE</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HARDWARE</name>
                                        <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>4</dim>
                    <dimIncrement>12</dimIncrement>
                    <dimArrayIndex>0,1,2,3</dimArrayIndex>
                    <name>TIMB1_CTRREGS[%s]</name>
                    <description></description>
                    <addressOffset>0x1100</addressOffset>
                    <register>
                        <name>TIMB1_CTL0</name>
                        <description>CTL0 register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>EN</name>
                                <description>Counter Enable</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>STARTSEL</name>
                                <description>Selects the source used to start the counter.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>STOPSEL</name>
                                <description>Selects the source used to stop the counter.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>RESETSEL</name>
                                <description>Selects the source used to reset the counter.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>CLKSEL</name>
                                <description>Clock sources</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMB1_LD</name>
                        <description>Counter period register.</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>VAL</name>
                                <description>Period value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMB1_CNT</name>
                        <description>Counter register.</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <fields>
                            <field>
                                <name>VALUE</name>
                                <description>Counter Value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
