mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EVENTLP</name>
            <groupName>EVENTLP</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x400C9000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EVENTLP_PUBCFG_DESC_EX</name>
                    <description>Extended Module Description</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_SINGLE_CHANNEL</name>
                            <description>Number of single channels contained in this instance of event manager</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_DUAL_CHANNEL</name>
                            <description>Number of dual channels contained in this instance of event manager</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_IMPORT</name>
                            <description>Number of import ports available in this EventManager instantiation</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_EXPORT</name>
                            <description>Number of export ports available in this EventManager instantiation</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>EVENTLP_PUBCFG_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>0</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_FSUB[%s]</name>
                    <description></description>
                    <addressOffset>0x100</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_FSUB_PORT</name>
                        <description>Subscriber channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for subscriber to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>0</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_FPUB[%s]</name>
                    <description></description>
                    <addressOffset>0x300</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_FPUB_PORT</name>
                        <description>Publisher channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for publisher to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x500</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for export side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x700</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>0</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_CPU_CONNECT[%s]</name>
                    <description></description>
                    <addressOffset>0x900</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_CPU_NUM</name>
                        <description>CPU connect register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                    </register>
                </cluster>
                <register>
                    <name>EVENTLP_SECCFG_DESC_EX</name>
                    <description>Extended Module Description</description>
                    <addressOffset>0x10F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_SINGLE_CHANNEL</name>
                            <description>Number of single channels contained in this instance of event manager</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_DUAL_CHANNEL</name>
                            <description>Number of dual channels contained in this instance of event manager</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_EXPORT</name>
                            <description>Number of export ports available in this EventManager instantiation</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_IMPORT</name>
                            <description>Number of import ports available in this EventManager instantiation</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>EVENTLP_SECCFG_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>0</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_FSUB[%s]</name>
                    <description></description>
                    <addressOffset>0x1100</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_FSUB_PORT</name>
                        <description>Subscriber channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for subscriber to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>0</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_FPUB[%s]</name>
                    <description></description>
                    <addressOffset>0x1180</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_FPUB_PORT</name>
                        <description>Publisher channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for publisher to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>1</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x1200</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for export side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>1</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x1280</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>0</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_CPU_CONNECT[%s]</name>
                    <description></description>
                    <addressOffset>0x1300</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_CPU_NUM</name>
                        <description>CPU connect register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                    </register>
                </cluster>
                <register>
                    <name>EVENTLP_CTL</name>
                    <description>Event Manager control register</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OVRWR_EN</name>
                            <description>Enable overwrite of config even if resources are already configured. By default, a configuration cannot be overwritten.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Overwrite is disabled. Mode is same as in UNASG aperture.</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description>Ovewrite is enabled</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_IMPEXPCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x2000</addressOffset>
                    <register>
                        <name>EVENTLP_IMPEXPCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_IMPEXPCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x2200</addressOffset>
                    <register>
                        <name>EVENTLP_IMPEXPCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
