mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                    <register>
                        <name>UC4_SPI_DMA_TRIG_TX_ISET</name>
                        <description>Interrupt set</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>TX</name>
                                <description>Set Transmit FIFO event.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Set Interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>UC4_SPI_INTCTL</name>
                    <description>Interrupt control register</description>
                    <addressOffset>0x10E4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>INTEVAL</name>
                            <description>Writing a 1 to this field re-evaluates the interrupt sources.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The interrupt or event line is disabled.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EVAL</name>
                                        <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC4_SPI_CTL0</name>
                    <description>SPI control register 0</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DSS</name>
                            <description>Data Size Select.
Values 0 - 2 are reserved and shall not be used.
3h = 4_BIT : 4-bit data
SPI allows only values up to 16 Bit</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DSS_4</name>
                                        <description>Data Size Select bits: 4</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_5</name>
                                        <description>Data Size Select bits: 5</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_6</name>
                                        <description>Data Size Select bits: 6</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_7</name>
                                        <description>Data Size Select bits: 7</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_8</name>
                                        <description>Data Size Select bits: 8</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_9</name>
                                        <description>Data Size Select bits: 9</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_10</name>
                                        <description>Data Size Select bits: 10</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_11</name>
                                        <description>Data Size Select bits: 11</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_12</name>
                                        <description>Data Size Select bits: 12</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_13</name>
                                        <description>Data Size Select bits: 13</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_14</name>
                                        <description>Data Size Select bits: 14</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_15</name>
                                        <description>Data Size Select bits: 15</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DSS_16</name>
                                        <description>Data Size Select bits: 16</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FRF</name>
                            <description>Frame format Select</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MOTOROLA_3WIRE</name>
                                        <description>Motorola SPI frame format (3 wire mode)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MOTOROLA_4WIRE</name>
                                        <description>Motorola SPI frame format (4 wire mode)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TI_SYNC</name>
                                        <description>TI synchronous serial frame format</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SPO</name>
                            <description>CLKOUT polarity (Motorola SPI frame format only)</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>SPI produces a steady state LOW value on the CLKOUT</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGH</name>
                                        <description>SPI produces a steady state HIGH value on the CLKOUT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SPH</name>
                            <description>CLKOUT phase (Motorola SPI frame format only)
This bit selects the clock edge that captures data and enables it to change state. It
has the most impact on the first bit transmitted by either permitting or not permitting a clock transition before the first data capture edge.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FIRST</name>
                                        <description>Data is captured on the first clock edge transition.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SECOND</name>
                                        <description>Data is captured on the second clock edge transition.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CSCLR</name>
                            <description>Clear shift register counter on CS inactive
This bit is relevant only in the peripheral, CTL1.CP=0.</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable automatic clear of shift register when CS goes to disable.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable automatic clear of shift register when CS goes to disable.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC4_SPI_STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOT_EMPTY</name>
                                        <description>Transmit FIFO is not empty.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EMPTY</name>
                                        <description>Transmit FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFE</name>
                            <description>Receive FIFO empty.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOT_EMPTY</name>
                                        <description>Receive FIFO is not empty.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EMPTY</name>
                                        <description>Receive FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BUSY</name>
                            <description>Busy</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>IDLE</name>
                                        <description>SPI is in idle mode.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ACTIVE</name>
                                        <description>SPI is currently transmitting and/or receiving data</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO Clear Status</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO Clear Status</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFF</name>
                            <description>Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver can receive data.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXFF</name>
                            <description>Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter is not full.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
