mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                <register>
                    <name>SYSCTL_CLKSTATUS</name>
                    <description>Clock module (CKM) status</description>
                    <addressOffset>0x1204</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xb3b37fd3</resetMask>
                    <fields>
                        <field>
                            <name>LFOSCGOOD</name>
                            <description>LFOSCGOOD indicates when the LFOSC startup has completed and the LFOSC is ready for use.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>LFOSC is not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>LFOSC is ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFCLKGOOD</name>
                            <description>HFCLKGOOD indicates that the HFCLK started correctly.  When the HFXT is started or HFCLK_IN is selected as the HFCLK source,  this bit will be set by hardware if a valid HFCLK is detected, and cleared if HFCLK is not operating within the expected range.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>HFCLK did not start correctly</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>HFCLK started correctly</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HSCLKDEAD</name>
                            <description>HSCLKDEAD is set by hardware if the selected source for HSCLK was started but did not start successfully.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>The HSCLK source was not started or started correctly</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>The HSCLK source did not start correctly</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSPLLBLKUPD</name>
                            <description>SYSPLLBLKUPD indicates when writes to SYSPLLCFG0/1 and SYSPLLPARAM0/1 are blocked.</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>writes to SYSPLLCFG0/1 and SYSPLLPARAM0/1 are allowed</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>writes to SYSPLLCFG0/1 and SYSPLLPARAM0/1 are blocked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFCLKOFF</name>
                            <description>HFCLKOFF indicates if the HFCLK is disabled or was dead at startup.  When the HFCLK is started, HFCLKOFF is cleared by hardware.  Following startup of the HFCLK, if the HFCLK startup monitor determines that the HFCLK was not started correctly, HFCLKOFF is set.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>HFCLK started correctly and is enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>HFCLK is disabled or was dead at startup</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HFCLKBLKUPD</name>
                            <description>HFCLKBLKUPD indicates when writes to the HFCLKCLKCFG register are blocked.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>Writes to HFCLKCLKCFG are allowed</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Writes to HFCLKCLKCFG are blocked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HSCLKGOOD</name>
                            <description>HSCLKGOOD is set by hardware if the selected clock source for HSCLK started successfully.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>The HSCLK source did not start correctly</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>The HSCLK source started correctly</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSPLLGOOD</name>
                            <description>SYSPLLGOOD indicates if the SYSPLL started correctly.  When the SYSPLL is started, SYSPLLGOOD is cleared by hardware.  After the startup settling time has expired, the SYSPLL status is tested.  If the SYSPLL started successfully the SYSPLLGOOD bit is set, else it is left cleared.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>SYSPLL did not start correctly</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>SYSPLL started correctly</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ANACLKERR</name>
                            <description>ANACLKERR is set when the device clock configuration does not support an enabled analog peripheral mode and the analog peripheral may not be functioning as expected.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>No analog clock errors detected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Analog clock error detected</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HSCLKMUX</name>
                            <description>HSCLKMUX indicates if MCLK is currently sourced from the high-speed clock (HSCLK).</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC</name>
                                        <description>MCLK is not sourced from HSCLK</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HSCLK</name>
                                        <description>MCLK is sourced from HSCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LFCLKMUX</name>
                            <description>LFCLKMUX indicates if LFCLK is sourced from the internal LFOSC, the low frequency crystal (LFXT), or the LFCLK_IN digital clock input.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LFOSC</name>
                                        <description>LFCLK is sourced from the internal LFOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LFXT</name>
                                        <description>LFCLK is sourced from the LFXT (crystal)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXLF</name>
                                        <description>LFCLK is sourced from LFCLK_IN (external digital clock  input)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSOSCFREQ</name>
                            <description>SYSOSCFREQ indicates the current SYSOSC operating frequency.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC32M</name>
                                        <description>SYSOSC is at base frequency (32MHz)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSC4M</name>
                                        <description>SYSOSC is at low frequency (4MHz)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSCUSER</name>
                                        <description>SYSOSC is at the user-trimmed frequency (16 or 24MHz)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSCTURBO</name>
                                        <description>Reserved</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LFXTGOOD</name>
                            <description>LFXTGOOD indicates if the LFXT started correctly.  When the LFXT is started, LFXTGOOD is cleared by hardware.  After the startup settling time has expired, the LFXT status is tested.  If the LFXT started successfully the LFXTGOOD bit is set, else it is left cleared.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>LFXT did not start correctly</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>LFXT started correctly</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>HSCLKSOFF</name>
                            <description>HSCLKSOFF is set when the high speed clock sources (SYSPLL, HFCLK) are disabled or dead.  It is the logical AND of HFCLKOFF and SYSPLLOFF.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>SYSPLL, HFCLK, or both were started correctly and remain enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>SYSPLL and HFCLK are both either off or dead</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FCLMODE</name>
                            <description>FCLMODE indicates if the SYSOSC frequency correction loop (FCL) is enabled.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>SYSOSC FCL is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description>SYSOSC FCL is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CURHSCLKSEL</name>
                            <description>CURHSCLKSEL indicates the current clock source for HSCLK.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSPLL</name>
                                        <description>HSCLK is currently sourced from the SYSPLL</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>HSCLK is currently sourced from the HFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CURMCLKSEL</name>
                            <description>CURMCLKSEL indicates if MCLK is currently sourced from LFCLK.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOTLFCLK</name>
                                        <description>MCLK is not sourced from LFCLK</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LFCLK</name>
                                        <description>MCLK is sourced from LFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FCCDONE</name>
                            <description>FCCDONE indicates when a frequency clock counter capture is complete.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOTDONE</name>
                                        <description>FCC capture is not done</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DONE</name>
                                        <description>FCC capture is done</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSPLLOFF</name>
                            <description>SYSPLLOFF indicates if the SYSPLL is disabled or was dead at startup.  When the SYSPLL is started, SYSPLLOFF is cleared by hardware.  Following startup of the SYSPLL, if the SYSPLL startup monitor determines that the SYSPLL was not started correctly, SYSPLLOFF is set.</description>
                            <bitOffset>0xE</bitOffset>
