mspm0-rs/mspm0-data-sources/svd/MSPM0G120X.svd
                <register>
                    <name>ADC0_CTL2</name>
                    <description>Control Register 2</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DF</name>
                            <description>Data read-back format. Data is always stored in binary unsigned format.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNSIGNED</name>
                                        <description>Digital result reads as Binary Unsigned.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED</name>
                                        <description>Digital result reads Signed Binary. (2s complement), left aligned.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RES</name>
                            <description>Resolution. These bits define the resolution of ADC conversion result.
Note : A value of 3 defaults to 12-bits resolution.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BIT_12</name>
                                        <description>12-bits resolution</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BIT_10</name>
                                        <description>10-bits resolution</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BIT_8</name>
                                        <description>8-bits resolution</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STARTADD</name>
                            <description>Sequencer start address. These bits select which MEMCTLx is used for single conversion or as first MEMCTL for sequence mode. 
The value of STARTADD is 0x00 to 0x17, corresponding to MEMRES0 to MEMRES23.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ADDR_00</name>
                                        <description>MEMCTL0 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_01</name>
                                        <description>MEMCTL1 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_02</name>
                                        <description>MEMCTL2 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_03</name>
                                        <description>MEMCTL3 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_04</name>
                                        <description>MEMCTL4 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_05</name>
                                        <description>MEMCTL5 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_06</name>
                                        <description>MEMCTL6 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_07</name>
                                        <description>MEMCTL7 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_08</name>
                                        <description>MEMCTL8 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_09</name>
                                        <description>MEMCTL9 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_10</name>
                                        <description>MEMCTL10 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_11</name>
                                        <description>MEMCTL11 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_12</name>
                                        <description>MEMCTL12 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_13</name>
                                        <description>MEMCTL13 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_14</name>
                                        <description>MEMCTL14 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_15</name>
                                        <description>MEMCTL15 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_16</name>
                                        <description>MEMCTL16 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_17</name>
                                        <description>MEMCTL17 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_18</name>
                                        <description>MEMCTL18 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_19</name>
                                        <description>MEMCTL19 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_20</name>
                                        <description>MEMCTL20 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_21</name>
                                        <description>MEMCTL21 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_22</name>
                                        <description>MEMCTL22 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_23</name>
                                        <description>MEMCTL23 is selected as start address of a sequence or for a single conversion.</description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENDADD</name>
                            <description>Sequence end address. These bits select which MEMCTLx is the last one for the sequence mode.
The value of ENDADD is 0x00 to 0x17, corresponding to MEMRES0 to MEMRES23.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ADDR_00</name>
                                        <description>MEMCTL0 is selected as end address of sequence.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_01</name>
                                        <description>MEMCTL1 is selected as end address of sequence.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_02</name>
                                        <description>MEMCTL2 is selected as end address of sequence.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_03</name>
                                        <description>MEMCTL3 is selected as end address of sequence.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_04</name>
                                        <description>MEMCTL4 is selected as end address of sequence.</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_05</name>
                                        <description>MEMCTL5 is selected as end address of sequence.</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_06</name>
                                        <description>MEMCTL6 is selected as end address of sequence.</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_07</name>
                                        <description>MEMCTL7 is selected as end address of sequence.</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_08</name>
                                        <description>MEMCTL8 is selected as end address of sequence.</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_09</name>
                                        <description>MEMCTL9 is selected as end address of sequence.</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_10</name>
                                        <description>MEMCTL10 is selected as end address of sequence.</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_11</name>
                                        <description>MEMCTL11 is selected as end address of sequence.</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_12</name>
                                        <description>MEMCTL12 is selected as end address of sequence.</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_13</name>
                                        <description>MEMCTL13 is selected as end address of sequence.</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_14</name>
                                        <description>MEMCTL14 is selected as end address of sequence.</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_15</name>
                                        <description>MEMCTL15 is selected as end address of sequence.</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_16</name>
                                        <description>MEMCTL16 is selected as end address of sequence.</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_17</name>
                                        <description>MEMCTL17 is selected as end address of sequence.</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_18</name>
                                        <description>MEMCTL18 is selected as end address of sequence.</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_19</name>
                                        <description>MEMCTL19 is selected as end address of sequence.</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_20</name>
                                        <description>MEMCTL20 is selected as end address of sequence.</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_21</name>
                                        <description>MEMCTL21 is selected as end address of sequence.</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_22</name>
                                        <description>MEMCTL22 is selected as end address of sequence.</description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_23</name>
                                        <description>MEMCTL23 is selected as end address of sequence.</description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DMAEN</name>
                            <description>Enable DMA trigger for data transfer. 
Note: DMAEN bit is cleared by hardware based on DMA done signal at the end of data transfer. Software has to re-enable DMAEN bit for ADC to generate DMA triggers.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>DMA trigger not enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>DMA trigger enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SAMPCNT</name>
                            <description>Number of ADC converted samples to be transferred on a DMA trigger</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MIN</name>
                                        <description>Minimum value</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAX</name>
                                        <description>Maximum value</description>
                                        <value>0x18</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
